<%--
  Created by IntelliJ IDEA.
  User: Beetle
  Date: 18.05.2022
  Time: 15:45
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
  <head>
    <title>Стартовая страница</title>
  </head>
  <body>
    <h1>Селиванов Егор</h1>
    <ul>
      <li>На «Главной странице» инициировать вычисление функции из задания первой
        лабораторной работы.</li>
      <li>Параметры необходимые для работы функции реализуемой на «Главной странице»
        задавать на ней в текстовом поле, а результат её работы показывать на «Финишной
        странице».</li>
      <li>Программный код вычисляемой функции разместить: 1 – в классе Bean-компоненты</li>
      <li>Заголовки страниц должны иметь следующий вид: 0 – «Стартовая страница»,
        «Главная страница» и «Финишная страница»;</li>
      <li>Формат «Стартовой страницы»: 0 – содержит текст задания на лабораторную работу,
        ФИО студента и ссылку для перехода на «Главную страницу»</li>
      <li>Организовать вывод результатов работы функции на «Финишной странице»: 1 – результаты должны быть каким-то
        образом размещены в видимой таблице, в таблице допускается произвольное число
        столбцов и строк;</li>
      <li>При повторном переходе на «Главную страницу», например при нажатии кнопки
        «Возврат» на «Финишной странице», на «Главной странице» должно отображаться:
        1 – изменение счётчика, размещённого на «Главной странице»;</li>
    </ul>
    <a href="main.jsp">Переход на главную страницу</a>
  </body>
</html>
